tutorials/lagrangian/porousExplicitSourceReactingParcelFoam/parcelInBox/0/G
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    back
    {
        type            symmetryPlane;
    }
    front
    {
        type            symmetryPlane;
    }
    walls
    {
        type            MarshakRadiation;
        T               T;
        emissivity      1;
        value           uniform 0;
    }
    outlet
    {
        type            zeroGradient;
    }
    inlet
    {
        type            MarshakRadiation;
        T               T;
        emissivity      1;
        value           uniform 0;
    }
}


// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
